<template lang="pug">
.wrapper
    .hello-world
        h3 Привет!
        p Это результат выполнения тестового задания :)
        p Для того, чтобы посмотреть, что я тут понаделал, нужно перейти по адресу 
            b  /bob?token=<токен>. 
            | Пароль - marley. 
            | Токен, как и требовалось, задается через переменные окружения. 
            | Я сделал это в файле .env. По дефолту токен - VerySecretToken.
        p Я старался выполнить задание наиболее интересным образом и с вниманием к мелочам. 
            | Может показаться, что некоторые вещи избыточны, но я исходил из предоставленных данных в задании. 
        p Например, здесь использован vuex для хранения данных, полученных с сервера потому, что требуется 
            | только один endpoint сервера, при этом у нас есть два разных модуля, которые взаимосвязаны. 
            | Можно было всё предельно упростить, и использовать props, но хотелось сделать что-то более-менее приближенное к реальному приложению.
        p Но, тем не менее, я решил, что могу переусердствовать и слишком затянуть выполнение, поэтому остановился на текущем варианте. 
            | А то в планах было сделать даже версию для мобильных и раздробить на более мелкие компоненты)
        P Вне зависимости от вашего решения, буду рад получить подробное ревью кода. 
</template>

<style lang="sass" scoped>
.wrapper
    display: grid 
    height: 100vh
    align-items: center
    align-content: center
    justify-items: center

.hello-world
    width: 30vw
    align-items: center
    justify-items: center

p
    text-align: center
    line-height: 1.8em
</style>
